In [41]:
import sqlalchemy as sqla
import pymysql
import pandas as pd
import os

user="user"
password="grad5100user"
awsresource="database-1.cwvjklnp4wu3.us-east-1.rds.amazonaws.com"
dbname="topChef"
port= 3306

dburi = f"mysql+pymysql://{user}:{password}@{awsresource}:{port}/{dbname}"
engine = sqla.create_engine(dburi)

In [42]:
#functions to make it run easier
def run_sql(sql, engine):
    with engine.connect() as conn:
        result = conn.execute(sqla.text(sql))
    return result.all()


def df_select(sql, engine):
    with engine.connect() as conn:
        result = pd.read_sql(sqla.text(sql), con=conn)
    print(f"Retrieved {result.shape[0]} records")
    return result

In [57]:
#Accessing info
tables = run_sql("show tables;", engine)
for x in tables:
    print(x)

('challengedescriptions',)
('challengewins',)
('chefdetails',)
('episodeinfo',)
('judges',)
('rewards',)

In [94]:
chef_info = run_sql("describe chefdetails;", engine)
for x in chef_info[:15]:
    print(x)

('num', 'bigint', 'YES', 'MUL', None, '')
('name', 'text', 'YES', '', None, '')
('chef', 'text', 'YES', '', None, '')
('hometown', 'text', 'YES', '', None, '')
('city', 'text', 'YES', '', None, '')
('state', 'text', 'YES', '', None, '')
('age', 'double', 'YES', '', None, '')
('season', 'text', 'YES', '', None, '')
('seasonNumber', 'bigint', 'YES', '', None, '')
('series', 'text', 'YES', '', None, '')
('placement', 'bigint', 'YES', '', None, '')
('personOfColor', 'text', 'YES', '', None, '')
('occupation', 'text', 'YES', '', None, '')
('gender', 'text', 'YES', '', None, '')

In [45]:
judge_info = run_sql("describe judges;", engine)
for x in judge_info[:10]:
    print(x)

('num', 'bigint', 'YES', 'MUL', None, '')
('season', 'text', 'YES', '', None, '')
('seasonNumber', 'bigint', 'YES', '', None, '')
('series', 'text', 'YES', '', None, '')
('episode', 'bigint', 'YES', '', None, '')
('challengeType', 'text', 'YES', '', None, '')
('outcomeType', 'text', 'YES', '', None, '')
('guestJudge', 'text', 'YES', '', None, '')
('competedOnTC', 'text', 'YES', '', None, '')
('otherShows', 'text', 'YES', '', None, '')

In [114]:
#Problem 1 (All chef details info) 
a_chefdetails = df_select("select * from chefdetails where season NOT LIKE '%Masters%' AND season NOT LIKE 'Canada 6';", engine)
a_chefdetails

Retrieved 322 records

,num,name,chef,hometown,city,state,age,season,seasonNumber,series,placement,personOfColor,occupation,gender
0,0,Richard Blais,Richard B.,None,None,None,38.0,All Stars: New York,8,US,1,None,Owner,Male
1,1,Mike Isabella,Mike I.,None,None,None,35.0,All Stars: New York,8,US,2,None,Executive Chef/Owner,Male
2,2,Antonia Lofaso,Antonia L.,None,None,None,34.0,All Stars: New York,8,US,3,None,Executive Chef,Female
3,3,Tiffany Derry,Tiffany D.,None,None,None,27.0,All Stars: New York,8,US,4,POC,Executive Chef,Female
4,4,Carla Hall,Carla H.,None,None,None,46.0,All Stars: New York,8,US,5,POC,Chef/Owner,Female
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
317,386,May Phattanant Thongthong,May Phattanant Thongthong,"Chiang Mai, Thailand",Bangkok,Thailand,NaN,World All Stars,20,US,14,POC,Executive Chef/Co-Partner,Female
318,387,Begona Rodrigo,Begona Rodrigo,"Valencia, Spain",Valencia,Spain,NaN,World All Stars,20,US,12,None,Owner,Female
319,388,Gabriel Rodriguez,Gabriel Rodriguez,"Iztapalapa, Mexico City",Madrid,Spain,NaN,World All Stars,20,US,2,POC,Executive Chef,Male
320,389,Amar Santana,Amar S.,Dominican Republic / Queens,Santa Ana,California,NaN,World All Stars,20,US,6,POC,Chef/Partner,Male
321,390,Sylwia Stachyra,Sylwia Stachyra,"Lublin, Poland",Lublin,Poland,NaN,World All Stars,20,US,11,None,Consultant/Cooking School Owner,Female

In [115]:
#Problem 1 (All judges info)
a_judges = df_select("select * from judges where season NOT LIKE '%Masters%' AND season NOT LIKE 'Canada 6';", engine)
a_judges

Retrieved 633 records

,num,season,seasonNumber,series,episode,challengeType,outcomeType,guestJudge,competedOnTC,otherShows
0,0,All Stars: New York,8,US,1,Quickfire,Team,Tom Colicchio,None,Top Chef Judge
1,1,All Stars: New York,8,US,1,Elimination,Individual,Anthony Bourdain,None,Parts Unknown; No Reservations
2,2,All Stars: New York,8,US,2,Quickfire,Individual,Joe Jonas,None,None
3,3,All Stars: New York,8,US,2,Elimination,Team,Katie Lee,None,Beat Bobby Flay Judge
4,4,All Stars: New York,8,US,3,Quickfire,Team,David Chang,None,None
...,...,...,...,...,...,...,...,...,...,...
628,750,World All Stars,20,US,12,Quickfire,Individual,Sam Bompas,None,None
629,751,World All Stars,20,US,12,Elimination,Individual,Jeremy Chan,None,None
630,752,World All Stars,20,US,13,Quickfire,Individual,Greg Marchand,None,None
631,753,World All Stars,20,US,13,Elimination,Individual,Greg Marchand,None,None
632,754,World All Stars,20,US,14,Elimination,Individual,Helene Darroze,None,None

In [54]:
#Problem 2 (Chef details) 

abr_chefdetails = df_select("select season, seasonNumber, name, placement, gender from chefdetails where season NOT LIKE '%Masters%' AND season NOT LIKE 'Canada 6';", engine)
abr_chefdetails

Retrieved 322 records

,season,seasonNumber,name,placement,gender
0,All Stars: New York,8,Richard Blais,1,Male
1,All Stars: New York,8,Mike Isabella,2,Male
2,All Stars: New York,8,Antonia Lofaso,3,Female
3,All Stars: New York,8,Tiffany Derry,4,Female
4,All Stars: New York,8,Carla Hall,5,Female
...,...,...,...,...,...
317,World All Stars,20,May Phattanant Thongthong,14,Female
318,World All Stars,20,Begona Rodrigo,12,Female
319,World All Stars,20,Gabriel Rodriguez,2,Male
320,World All Stars,20,Amar Santana,6,Male
321,World All Stars,20,Sylwia Stachyra,11,Female

In [56]:
#Problem 2 (Judges)
abr_judges = df_select("select season, seasonNumber, episode, challengeType, guestJudge, competedOnTC from judges where season NOT LIKE '%Masters%' AND season NOT LIKE 'Canada 6';", engine)
abr_judges

Retrieved 633 records

,season,seasonNumber,episode,challengeType,guestJudge,competedOnTC
0,All Stars: New York,8,1,Quickfire,Tom Colicchio,None
1,All Stars: New York,8,1,Elimination,Anthony Bourdain,None
2,All Stars: New York,8,2,Quickfire,Joe Jonas,None
3,All Stars: New York,8,2,Elimination,Katie Lee,None
4,All Stars: New York,8,3,Quickfire,David Chang,None
...,...,...,...,...,...,...
628,World All Stars,20,12,Quickfire,Sam Bompas,None
629,World All Stars,20,12,Elimination,Jeremy Chan,None
630,World All Stars,20,13,Quickfire,Greg Marchand,None
631,World All Stars,20,13,Elimination,Greg Marchand,None
632,World All Stars,20,14,Elimination,Helene Darroze,None

In [59]:
#Problem 3 
seasons_table = df_select("select distinct season, seasonNumber from judges where season NOT LIKE 'Canada 6' and season NOT LIKE '%Masters%' order by seasonNumber;", engine)
seasons_table

Retrieved 21 records

                 season  seasonNumber
0         San Francisco             1
1           Los Angeles             2
2                 Miami             3
3               Chicago             4
4              New York             5
5             Las Vegas             6
6                  D.C.             7
7   All Stars: New York             8
8                 Texas             9
9               Seattle            10
10          New Orleans            11
11               Boston            12
12           California            13
13           Charleston            14
14          Charleston             14
15             Colorado            15
16             Kentucky            16
17       All-Stars L.A.            17
18             Portland            18
19              Houston            19
20      World All Stars            20

In [73]:
#Problem 4A
abr_chefdetails.groupby('gender').count()

        season  seasonNumber  name  placement
gender
Female     152           152   152        152
Male       170           170   170        170

In [75]:
#Problem 4B
winners = abr_chefdetails[abr_chefdetails['placement']==1]
winners.groupby('gender').count()

        season  seasonNumber  name  placement
gender
Female       6             6     6          6
Male        14            14    14         14

In [89]:
#Problem 4C
top3 = abr_chefdetails[abr_chefdetails['placement'].isin([1, 2, 3])]
top3.groupby('gender').count()

#Problem 4D
#Women placed in the top 3, 25 times and won 6 times. This averages out to about a 24% win rate. 
#Men placed in the top 3, 36 times and won 14 times. This averages out to about a 39% win rate.
#Women who place in the top 3 are about 15% less likely then men to place first.

        season  seasonNumber  name  placement
gender
Female      25            25    25         25
Male        36            36    36         36

In [108]:
#Problem 4 (Making a winner to judge table) 
winners_to_judge = df_select("""
    SELECT chefdetails.name, chefdetails.season, IF(judges.guestJudge IS NOT NULL, 'Yes', 'No') as was_a_guest_judge
    FROM chefdetails
    LEFT JOIN judges ON chefdetails.name = judges.guestJudge AND chefdetails.season = judges.season
    WHERE chefdetails.placement = 1
""", engine)

winners_to_judge

Retrieved 26 records

                    name               season was_a_guest_judge
0          Richard Blais  All Stars: New York                No
1           Melissa King       All-Stars L.A.                No
2                Mei Lin               Boston                No
3            Jeremy Ford           California                No
4            Ross Larkin             Canada 6                No
5      Brooke Williamson           Charleston                No
6        Stephanie Izard              Chicago                No
7           Kevin Sbraga                 D.C.                No
8           Joseph Flamm             Colorado                No
9             Kah-wai Lo              Houston                No
10  Kelsey Barnard Clark             Kentucky                No
11     Michael Voltaggio            Las Vegas                No
12             Ilan Hall          Los Angeles                No
13          Rick Bayless     Masters Season 1                No
14            Hung Huynh                Miami                No
15         Nicholas Elmi          New Orleans                No
16       Hosea Rosenberg             New York                No
17           Gabe Erales             Portland                No
18       Harold Dieterle        San Francisco                No
19          Kristen Kish              Seattle                No
20              Paul Qui                Texas                No
21     Marcus Samuelsson     Masters Season 2                No
22          Floyd Cardoz     Masters Season 3                No
23            Kah-wai Lo      World All Stars                No
24       Chris Cosentino     Masters Season 4               Yes
25         Douglas Keane     Masters Season 5                No

In [109]:
#Problem #5 (Making a loser to judge table)  
losers_to_judge = df_select("""
    SELECT chefdetails.name, chefdetails.season, IF(judges.guestJudge IS NOT NULL, 'Yes', 'No') as was_a_guest_judge
    FROM chefdetails
    INNER JOIN judges ON chefdetails.name = judges.guestJudge AND chefdetails.season = judges.season
    WHERE chefdetails.placement != 1
""", engine)

losers_to_judge

Retrieved 9 records

                 name            season was_a_guest_judge
0        Patricia Yeo  Masters Season 4               Yes
1       Lorena Garcia  Masters Season 4               Yes
2     Kerry Heffernan  Masters Season 4               Yes
3       Lee Anne Wong     San Francisco               Yes
4      Miguel Morales     San Francisco               Yes
5    Stephen Asprinio     San Francisco               Yes
6  Josie Smith-Malave           Seattle               Yes
7      Stefan Richter           Seattle               Yes
8           Sang Yoon  Masters Season 5               Yes